2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/KUC054-Opschorting_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#|MIG_RegistreerOpschorting_B|}</soapenv:Header>
   <soapenv:Body>
      <brp:MIG_RegistreerOpschorting_B xmlns:brp="http://www.bzk.nl/brp/brp0200">
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>${DataSource Values#zendendePartij_zsM0}</brp:zendendePartij>
            <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsM0}</brp:zendendeSysteem>
            <brp:referentienummer>${DataSource Values#referentienummer_sMB0}</brp:referentienummer>
            <brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="id.parameters0">
            <brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pMB0}</brp:verwerkingswijze>
         </brp:parameters>
         <brp:opschortingIngezetene
                                    brp:communicatieID="id.opschortingIngezetene0"
                                    brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_oMB0}</brp:partijCode>
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_oMB0}</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding1" brp:referentieID="${DataSource Values#|gedeblokkeerdeMelding1|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggo0}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggo0}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
               <brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding2" brp:referentieID="${DataSource Values#|gedeblokkeerdeMelding2|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggo1}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggo1}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
               <brp:document brp:communicatieID="${DataSource Values#|id.document1|}" brp:objecttype="Document">
                  <brp:soortNaam>${DataSource Values#soortNaam_dbo0}</brp:soortNaam>
                  <brp:identificatie>${DataSource Values#identificatie_dbo0}</brp:identificatie>
                  <brp:aktenummer>${DataSource Values#aktenummer_dbo0}</brp:aktenummer>
                  <brp:partijCode>${DataSource Values#partijCode_dbo0}</brp:partijCode>
               </brp:document>
               <brp:document brp:communicatieID="${DataSource Values#|id.document2|}" brp:objecttype="Document">
                  <brp:soortNaam>${DataSource Values#soortNaam_dbo1}</brp:soortNaam>
                  <brp:identificatie>${DataSource Values#identificatie_dbo1}</brp:identificatie>
                  <brp:aktenummer>${DataSource Values#aktenummer_dbo1}</brp:aktenummer>
                  <brp:partijCode>${DataSource Values#partijCode_dbo1}</brp:partijCode>
               </brp:document>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieBijhouding brp:communicatieID="id.registratieBijhouding0" brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rao0}</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <brp:document brp:communicatieID="id.document3" brp:referentieID="${DataSource Values#|id.document3|}"
                                   brp:objecttype="Document">${DataSource Values#document_bra0}</brp:document>
                     <brp:document brp:communicatieID="id.document4" brp:referentieID="${DataSource Values#|id.document4|}"
                                   brp:objecttype="Document">${DataSource Values#document_bra1}</brp:document>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="id.persoon1" brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|persoon1|}">
                     <brp:bijhouding brp:communicatieID="id.opschorting0">
                        <brp:nadereBijhoudingsaardCode>${DataSource Values#nadereBijhoudingsaardCode_opr0}</brp:nadereBijhoudingsaardCode>
                     </brp:bijhouding>
                  </brp:persoon>
               </brp:registratieBijhouding>
               <brp:wijzigingVerstrekkingsbeperking brp:communicatieID="id.wijzigingVerstrekkingsbeperking0"
                                                      brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rao1}</brp:datumAanvangGeldigheid>
                  <brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rao0}</brp:datumEindeGeldigheid>
                  <brp:bronnen>
                     <brp:document brp:communicatieID="id.document5" brp:referentieID="${DataSource Values#|document5|}"
                                   brp:objecttype="Document">${DataSource Values#document_bra2}</brp:document>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="id.persoon2" brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|persoon2|}">
                     <brp:indicaties>
                        <brp:volledigeVerstrekkingsbeperking brp:communicatieID="id.verstrekkingsbeperking0"
                                                    brp:objecttype="PersoonIndicatie">
                           <brp:waarde>${DataSource Values#waarde_vip0}</brp:waarde>
                        </brp:volledigeVerstrekkingsbeperking>
                     </brp:indicaties>
                  </brp:persoon>
               </brp:wijzigingVerstrekkingsbeperking>
            </brp:acties>
         </brp:opschortingIngezetene>
      </brp:MIG_RegistreerOpschorting_B>
   </soapenv:Body>
</soapenv:Envelope>
